Revit 2024 API
StructuralConnectionHandler.GetInputPoints Method
 Returns a list of additional points defining certain connections.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public IList<ConnectionInputPoint> GetInputPoints()
Visual Basic
Public Function GetInputPoints As IList(Of ConnectionInputPoint)
Visual C++
public:
IList<ConnectionInputPoint^>^ GetInputPoints()
See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace